Revit 2026 API

# BuiltInFailuresElementFailures Class

---

Failures about Elements.

SystemObject Autodesk.Revit.DBBuiltInFailuresElementFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ElementFailures
```
```vb
Public NotInheritable Class ElementFailures
```
```cpp
public ref class ElementFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ElementFailures = class end
```

The BuiltInFailuresElementFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FailedToRemoveElement | Element cannot be removed from the solution. The solution is required to have at least two elements to be valid. |
|  | NotAllowedToRemoveAllElements | You cannot removed all the elements from current solution. At least there should be two elements in the solution. |
|  | SplitElementHasTagsWithoutLeaders | The split element has one or more Tags without Leaders enabled and needs to be checked. |

#### Reference

Autodesk.Revit.DB Namespace